[Killed] BlockStatement
src/verificarIdade.ts:1:56
-export function verificarIdade(idade: number): boolean {
-  return idade >= 18;
-}
+export function verificarIdade(idade: number): boolean {}
 
killedBy: Verificar Idade maior de idade
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
src/verificarIdade.ts:2:10
 export function verificarIdade(idade: number): boolean {
-  return idade >= 18;
+  return idade < 18;
 }
 
killedBy: Verificar Idade maior de idade
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/verificarIdade.ts:2:10
 export function verificarIdade(idade: number): boolean {
-  return idade >= 18;
+  return true;
 }
 
killedBy: Verificar Idade maior de idade
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
