[Killed] BlockStatement
src/desconto.ts:1:49
-export function desconto(valor: number): number {
-  if (valor > 100) {
-    return valor * 0.9;
-  }
-
-  return valor;
-}
+export function desconto(valor: number): number {}
 
killedBy: Desconto deve aplicar desconto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 180
Received: undefined

[Killed] BlockStatement
src/desconto.ts:2:20
 export function desconto(valor: number): number {
-  if (valor > 100) {
-    return valor * 0.9;
-  }
+  if (valor > 100) {}
 
   return valor;
killedBy: Desconto deve aplicar desconto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 180
Received: 200

[Killed] EqualityOperator
src/desconto.ts:2:7
 export function desconto(valor: number): number {
-  if (valor > 100) {
+  if (valor <= 100) {
     return valor * 0.9;
   }
killedBy: Desconto deve aplicar desconto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 180
Received: 200

[Killed] ArithmeticOperator
src/desconto.ts:3:12
 export function desconto(valor: number): number {
   if (valor > 100) {
-    return valor * 0.9;
+    return valor / 0.9;
   }
 
killedBy: Desconto deve aplicar desconto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 180
Received: 222.22222222222223
