[Killed] BlockStatement
src/calculadora.ts:1:52
-export function soma(a: number, b: number): number {
-  return a + b;
-}
+export function soma(a: number, b: number): number {}
 
killedBy: Calculadora deve somar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: undefined

[Killed] ArithmeticOperator
src/calculadora.ts:2:10
 export function soma(a: number, b: number): number {
-  return a + b;
+  return a - b;
 }
 
killedBy: Calculadora deve somar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0
